In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]],
               columns=['col01', 'col02', 'col03'],
               index=['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [5]:
df = pd.DataFrame(np.array([[1,2,3], [4,5,6], [7,8,9]]),
               columns=['col01', 'col02', 'col03'],
               index=['idx01', 'idx02', 'idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [6]:
df.index

Index(['idx01', 'idx02', 'idx03'], dtype='object')

In [7]:
df.columns

Index(['col01', 'col02', 'col03'], dtype='object')

In [8]:
df.index = ['IDX01', 'IDX02', 'IDX03']
df

       col01  col02  col03
IDX01      1      2      3
IDX02      4      5      6
IDX03      7      8      9

In [10]:
df.columns = ['COL01', 'COL02', 'COL03']
df

       COL01  COL02  COL03
IDX01      1      2      3
IDX02      4      5      6
IDX03      7      8      9

In [11]:
df = df.rename(columns={'COL01': 'x'})     #一部の行・列名を変更
df

       x  COL02  COL03
IDX01  1      2      3
IDX02  4      5      6
IDX03  7      8      9

In [12]:
df = df.rename(columns={'COL02':'y','COL03':'z'})
df

       x  y  z
IDX01  1  2  3
IDX02  4  5  6
IDX03  7  8  9

In [13]:
df = df.rename(index={'IDX01':'w'})
df

       x  y  z
w      1  2  3
IDX02  4  5  6
IDX03  7  8  9

In [15]:
df['x']

w        1
IDX02    4
IDX03    7
Name: x, dtype: int32

In [16]:
type(df['x'])   #一列取り出すとseries化する

pandas.core.series.Series

In [17]:
df[['x']]    #列をデータフレーム形式でとる

       x
w      1
IDX02  4
IDX03  7

In [18]:
type(df[['x']])

pandas.core.frame.DataFrame

In [19]:
df.loc['w']

x    1
y    2
z    3
Name: w, dtype: int32

In [20]:
df.loc['w', 'x']    # 行と列両方を指定することができる

1

In [25]:
df.loc[:, 'x']          # 行、列 という順番で、: はすべてを表す

w        1
IDX02    4
IDX03    7
Name: x, dtype: int32

In [26]:
df.iloc[:,0]  #行番号や列番号で指定

w        1
IDX02    4
IDX03    7
Name: x, dtype: int32

In [27]:
df.dtypes

x    int32
y    int32
z    int32
dtype: object

In [28]:
df.loc['w', 'x']=100

In [29]:
df

         x  y  z
w      100  2  3
IDX02    4  5  6
IDX03    7  8  9

In [30]:
df.loc[:,'z']=['Tokyo', 'Osaka', 'Hokkaido']
df

         x  y         z
w      100  2     Tokyo
IDX02    4  5     Osaka
IDX03    7  8  Hokkaido

In [32]:
df.loc[:,'y':'z']      #スライスする

       y         z
w      2     Tokyo
IDX02  5     Osaka
IDX03  8  Hokkaido

In [35]:
df.iloc[:,1:3]    #3は含まれない

       y         z
w      2     Tokyo
IDX02  5     Osaka
IDX03  8  Hokkaido

In [36]:
df.index.get_loc('IDX03')

2

In [37]:
df.iloc[df.index.get_loc('w'),df.columns.get_loc('x')]=1000
df

          x  y         z
w      1000  2     Tokyo
IDX02     4  5     Osaka
IDX03     7  8  Hokkaido

In [38]:
df.dtypes

x     int32
y     int32
z    object
dtype: object

In [39]:
df.shape      #行数と列数を表示

(3, 3)

In [41]:
df.T     #行と列をいれ変える

       w  IDX02     IDX03
x   1000      4         7
y      2      5         8
z  Tokyo  Osaka  Hokkaido